/*alert("привет")
console.log("привет2")
prompt("привет3")*/
//1переменные-коробка(система хранения)
//2функции-набор действий(механизмы)
//3объекты-шкаф(данные храняться парами(ключ:значение)){}(система хранения)
//4массивы-поезд с вагонами [1,2,3](система хранения)
//5циклы-повторяющиеся действия(механизмы)
//6условия-разделения на события(механизмы)
//7типы данных-int-числа,str-строки,bool-логика (true or false)
let x = 4
const y = 10
var z = 7
console.log(x+y)
console.log(y/x)
console.log(z%x)
console.log(x**3)
console.log(x>y)
console.log(x==y)
if(x==5){
	console.log("да x = 5")
}
else{
	console.log("нет x не равен 5")
}

